## Introduction
### Author - Harshwardhan Fartale
We typically work with data in two-dimensional tables known as data frames, with rows and columns. But each
column in a data frame is built from a series, a one-dimensional data structure

This means that you can think of a data frame as a collection of series.


> Definition - Series is a one-dimensional labeled array for homogeneous data.

In [1]:
import pandas as pd

In [ ]:
#  Let’s create a Series object with data from a Python list.
ice_cream_flavors = [
    "Chocolate",
    "Vanilla",
    "Strawberry",
    "Butterscotch",
 ]

myseries=pd.Series(ice_cream_flavors)

## Note
# The two lines below are equivalent
#  pd.Series(ice_cream_flavors) #Positional Argument
#  pd.Series(data = ice_cream_flavors) #keyword Argument

> Keyword arguments are advantageous because they provide context for what each
 constructor argument represents. The second line in the example better communi
cates that ice_cream_flavors represents the data for the Series.

> Pandas Series dataframe comes with a load of parameter values

To get complete information, on a notebook type 
```pd.Series?```

In [9]:
myseries

0       Chocolate
1         Vanilla
2      Strawberry
3    Butterscotch
dtype: object

> In graphical spreadsheet applications, the first row of data starts counting at 1—an important difference between pandas and Excel

 ###  Customizing the Series index
 
 In addition to an index position, we can assign each Series value an index label.
 Index labels can be of any immutable data type: strings, tuples, datetimes, and more.
 This flexibility makes a Series powerful: we can reference a value by its order or by a
 key/label. In a sense, each value has two identifiers.

In [11]:
ice_cream_flavors = [
    "Chocolate",
    "Vanilla",
    "Strawberry",
    "Rum Raisin",
 ]
days_of_week = ("Monday", "Wednesday", "Friday", "Saturday")

newseries=pd.Series(ice_cream_flavors,days_of_week)

newseries

# The two lines below are equivalent
# pd.Series(ice_cream_flavors, days_of_week)
# pd.Series(data = ice_cream_flavors, index = days_of_week)

Monday        Chocolate
Wednesday       Vanilla
Friday       Strawberry
Saturday     Rum Raisin
dtype: object

>  The index permits duplicates, a detail that distinguishes a Series from a Python dictionary.

Showcase - Replace Saturday with Wednesday in the above example

ProTip - Although pandas permits duplicates, it is ideal to avoid them whenever possible,
 because a unique index allows the library to locate index labels more quickly.

In [12]:
bunch_of_bools = [True, False, False]
pd.Series(bunch_of_bools)

0     True
1    False
2    False
dtype: bool

In [13]:
stock_prices = [985.32, 950.44]
time_of_day = ["Open", "Close"]
pd.Series(data = stock_prices, index = time_of_day)

Open     985.32
Close    950.44
dtype: float64

In [14]:
lucky_numbers = [4, 8, 15, 16, 23, 42]
pd.Series(lucky_numbers)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

> The float64 and int64 data types indicate that each floating-point/integer value in
 the Series occupies 64 bits (8 bytes) of your computer’s RAM. Bits and bytes are stor
age units for memory.


Pandas does its best to infer an appropriate data type for the Series from the
data parameter’s values. We can force coercion to a different type via the constructor’s dtype parameter. The next example passes an integer list to the constructor but
asks for a floating-point Series:

In [15]:
lucky_numbers = [4, 8, 15, 16, 23, 42]
pd.Series(lucky_numbers, dtype = "float")

0     4.0
1     8.0
2    15.0
3    16.0
4    23.0
5    42.0
dtype: float64

### Creating a Series with missing values
In the real world, data is a lot messier. Perhaps the most frequent problem that analysts encounter is missing values.
When pandas sees a missing value during a file import, the library substitutes NumPy’s nan object. The acronym nan is short for not a number and is a catch-all term for an undefined value. In other words, nan is a placeholder object that represents nullness or absence.

In [17]:
import numpy as np
temperatures = [94, 88, np.nan, 91]
pd.Series(data = temperatures)

0    94.0
1    88.0
2     NaN
3    91.0
dtype: float64

>  Pandas automatically converts numeric values from integers to floating-points when it spots a nan value; this internal technical requirement allows the library to store numeric values and missing values in the same homogeneous Series

### Series with Python objects
The Series constructor’s data parameter accepts various inputs, including native Python data structures and objects from other libraries.

In [24]:
#Series from a dictionary
calorie_info = {
     "Cereal": 125,
     "Chocolate Bar": 406,
     "Ice Cream Sundae": 342,
 }
diet = pd.Series(calorie_info)
print(diet)
 
 
#Series from a tuple
color_info=pd.Series(data = ("Red", "Green", "Blue"))
print(color_info)

#Series from a set ?? 
# my_set = {"Ricky", "Bobby"}
# pd.Series(my_set)

Cereal              125
Chocolate Bar       406
Ice Cream Sundae    342
dtype: int64
0      Red
1    Green
2     Blue
dtype: object

### Question - Is Series from a set possible ? 

<details>
<summary>Click for Answer</summary>
 If we pass a set to the Series constructor, pandas raises a TypeError exception. A
 set has neither the concept of order (such as a list) nor the concept of association
 (such as a dictionary). Thus, the library cannot assume an order in which to store the
 set’s values. 
 If your program involves a set, transform it to an ordered data structure before pass
ing it to the Series constructor.
</details>

In [ ]:
# my_set = {"Ricky", "Bobby"}
# pd.Series(list(my_set))

In [28]:
#  The Series constructor’s data parameter also accepts a NumPy ndarray object.Many data science libraries use NumPy arrays, which are common storage formats for moving data around
random_data = np.random.randint(1, 101, 10)
print(random_data)
pd.Series(random_data)

[13 43 40 10 99 53 74 28 72 48]

0    13
1    43
2    40
3    10
4    99
5    53
6    74
7    28
8    72
9    48
dtype: int32

### Quickie on Attributes
An attribute is a piece of internal data belonging to an object, a characteristic or detail that exposes information about the object.We access an object’s attributes with dot syntax.

In [22]:
import datetime as dt
my_birthday=dt.date(2001,4,18)
print(my_birthday)
print(my_birthday.month)
print(my_birthday.year)
print(my_birthday.weekday())

2001-04-18

2

## Series attributes
A Series is composed of several smaller objects. Think of these objects as being puzzle pieces that join to make a greater whole

## IMP Point
This Series uses the NumPy library’s ndarray object to store the calorie counts and the pandas library’s Index object to store the food names in the index. We can access these nested objects through Series attributes. The values attribute, for example,exposes the ndarray object that stores the values:

Pandas delegates the responsibility of storing Series values to an object from a different library. That’s why NumPy is a dependency of pandas. The ndarray object optimizes for speed and efficiency by relying on the lower-level C programming language for many of its calculations. In many ways,the Series is a wrapper—an additional layer of functionality around a core NumPylibrary object.

In [35]:
diet.values

#If you are ever uncertain, use pandas built in type function to check types
print(type(diet.values))


#Pandas has its own objects, of course. The index attribute, for example, returns the Index object that stores the Series labels:
print(diet.index)

<class 'numpy.ndarray'>
Index(['Cereal', 'Chocolate Bar', 'Ice Cream Sundae'], dtype='object')

In [ ]:
## Some common Attributes
# dtype, for example, returns the data type of the Series’ values:
print(diet.dtype)

#  The size attribute returns the number of values in the Series:
print(diet.size)

#  The complementary shape attribute returns a tuple with the dimensions of a pandas data structure. For the one-dimensional Series, the tuple’s only value will be the Series’ size
print(diet.shape)


#is_unique attribute returns True if all Series values are unique
print(diet.is_unique)


# The is_monotonic attribute returns True if each Series value is greater than the previous one
print(pd.Series(data = [1, 3, 6]).is_monotonic)

## Attributes and Methods
A Python object has both attributes and methods. An attribute is a piece of data belonging to an object—a characteristic or detail that the data structure can reveal about itself

we accessed Series attributes such as size, shape, values, and index.
By comparison, a method is a function that belongs to an object—an action or command that we ask the object to perform. Methods typically involve some analysis, calculation, or manipulation of the object’s attributes. Attributes define an object’s state,and methods define an object’s behavior.

In [ ]:
values = range(0, 500, 5)
nums = pd.Series(data = values)

In [ ]:
#head - Display First 5 (default) values  
print(nums.head())
print(nums.head(10))

#tail - Display Last 5(default) values
print(nums.tail())
print(nums.tail(10))

In [ ]:
numbers = pd.Series([1, 2, 3, np.nan, 4, 5])
numbers


print(numbers.count())

print(numbers.sum())

#Most mathematical methods ignore missing values by default. We can pass an argu ment of False to the skipna parameter to force the inclusion of missing values.
print(numbers.sum(skipna=False)) #Forcefully include nan

print(numbers.product())

print(numbers.product(skipna=False))



#The sum method’s min_count parameter sets the minimum number of valid values a Series must hold for pandas to calculate its sum.
print(numbers.sum(min_count=3))

### Cum-sum and Percentage Change


#### Cum-sum
The cumsum (cumulative sum) method returns a new Series with a rolling sum of
values. Each index position holds the sum of values up to and including the value at
that index.A cumulative sum helps determine which values contribute most to the
total:



#### Percentage Change
The pct_change (percent change) method returns the percentage difference from one Series value to the next. At each index, pandas adds the last index’s value and the current index’s value and then divides the sum by the last index’s value. Pandas can calculate a percentage difference only if both indexes have valid values. The pct_change method defaults to a ```forward-fill``` strategy for missing values. With this strategy, pandas replaces a nan with the last valid value it encountered

An alternative strategy for dealing with missing values is a ```backfill``` solution. With this
option, pandas replaces a nan value with the next valid observation.

In [ ]:
print(numbers.cumsum())


print(numbers.pct_change())

In [ ]:
## Standard Statistical methods
print(numbers.mean())

print(numbers.median())

print(numbers.std())

print(numbers.max())

print(numbers.min())


# If you’re looking for a single method to summarize a Series effectively, the powerful describe method does the trick
print(numbers.describe())

> Pandas sorts a string Series alphabetically. The “smallest” string is the one closest to the start of the alphabet, and the “largest” string is the one closest to the end of the alphabet. Here’s a simple example with a small Series:

In [42]:
animals = pd.Series(["koala", "aardvark", "zebra"])
animals


print(animals.max())

print(animals.min())

zebra
aardvark

In [43]:
# complementary nunique method returns the number of unique values in the Series
authors = pd.Series(
     ["Hemingway", "Orwell", "Dostoevsky", "Fitzgerald", "Orwell"]
 )

print(authors.unique())

print(authors.nunique())

['Hemingway' 'Orwell' 'Dostoevsky' 'Fitzgerald']
4

### Arithmatic Operations on Series
Pandas gives us additional ways to perform arithmetic calculations with a Series

1. (+) for addition
2. (-) for subtraction
3. (*) for multiplication
4. (/) for division


The syntax is intuitive: treat the Series as a regular operand on one side of a mathematical operator. Place the complementary value on the other side of the operator.

In [ ]:
s1 = pd.Series(data = [5, np.nan, 15], index = ["A", "B", "C"])

print(s1 + 3)

###  How can we add an integer to a data structure?
<details>
<summary>Click for Answer</summary>
The types are seemingly incompatible. Behind the scenes, pandas
is smart enough to parse our syntax and understand that we’d like to add an integer to every value in the Series, not to the Series object itself.
</details>

In [ ]:
#Method based approach
print(s1.add(3))
print(s1 - 5)
print(s1.sub(5))
print(s1.subtract(5))


print(s1*2)
print(s1.mul(2))
print(s1.multiply(2))


print(s1 / 2)
print(s1.div(2))
print(s1.divide(2))

#modulo operator returns the remaineder of a division 
print(s1 % 3)
print(s1.mod(3))

### Broadcasting
Recall that pandas stores its Series values in a NumPy ndarray under the hood. When we use syntax such as s1 + 3 or s1 - 5, pandas delegates the mathematical calculations to NumPy.

The NumPy documentation uses the term broadcasting to describe the derivation of one array of values from another. Without diving too much into the technical details (you don’t need to understand NumPy’s complexities to work effectively with pandas),the term broadcasting comes from a radio broadcast tower, which transmits the same signal to all recipients listening in. Syntax like s1 + 3 means “Apply the same operation (add 3) to each value in the Series.” Each Series value gets the same message, much as every person listening to the same radio station at the same time hears the
same song.

Broadcasting also describes mathematical operations between multiple Series
objects. As a rule of thumb, pandas uses shared index labels to align values across different data structures.

In [51]:
s1 = pd.Series([10, 20, 30, 40],index=["A","B","C","D"])
s2 = pd.Series([100, 200, 300, 400],index=["A","B","C","D"])
print(s1+s2)

A    110
B    220
C    330
D    440
dtype: int64

In [53]:
s1 = pd.Series([10, 20, 30, 40],index=list('abcd'))
s2 = pd.Series([100, 200, 300, 400],index=list('dcba'))
print(s1+s2)

a    410
b    320
c    230
d    140
dtype: int64

In [55]:
s = pd.Series([10, 20, 30, 40],
index=list('abcd'))
print(s*10)

a    100
b    200
c    300
d    400
dtype: int64

### loc and iloc
> Note that pandas’ loc accessor has some differences with Python’s list-slicing syntax.For one, the loc accessor includes the label at the upper bound, whereas Python’s list slicing syntax excludes the value at the upper bound.

In [66]:
g = np.random.default_rng(0)
months = 'Sep Oct Nov Dec Jan Feb Mar Apr May Jun'.split()
s = pd.Series(g.integers(70, 101, 10),
index=months)
print(s)

Sep    96
Oct    89
Nov    85
Dec    78
Jan    79
Feb    71
Mar    72
Apr    70
May    75
Jun    95
dtype: int64

In [70]:
print(s[:5].mean())
print(s[5:].mean())

#.iloc retrieves based on the numeric position—the default index
print(s.iloc[:5].mean())


# If we want to get the scores from the first five months (September, October, November, December, and January), we can use the following slice:
first_half_average = s.loc['Sep':'Jan'].mean()
print(first_half_average)
#endpoint is “up to and including.” 
#That is, our 'Sep':'Jan' slice includes the value for January

85.4
76.6
85.4
85.4

## Serious Series Methods

### Importing a data set
Pandas offers various methods to read data from different formats. The most commonly used are
- `read_csv`
- `read_html`
- `read_json`
- `read_sql`
- `read_pickle`
- `read_clipboard`
- `read_xml`
- `read_excel`

We will use the read_csv method which is most commonly found
> A CSV is a plain-text file that separates each row of data with a line break and each row value with a comma.

## Pandas Dataframe

### Brackets or dots ?
When we’re working with a series, we can retrieve values several ways: using the index
(and loc), using the position (and iloc), and using square brackets, which are equivalent to loc for simple cases. When we work with data frames, though, we must use loc or iloc to retrieve rows. That’s because square brackets refer to the columns.

In [76]:
df = pd.DataFrame([[10, 20, 30, 40],
[50, 60, 70, 80],
[90, 100, 110, 120]],
index=list('xyz'),
columns=list('abcd'))


print(df['a']) #returns a column
print(df['b']) #returns a column
print(df[['a','b']]) #passing a list of columns #returns a new df with columns a and b

x    10
y    50
z    90
Name: a, dtype: int64
x     20
y     60
z    100
Name: b, dtype: int64
    a    b
x  10   20
y  50   60
z  90  100

> But there is an exception to the “square brackets mean columns” rule: if we use a
slice, pandas will look at the data frame’s rows, rather than its columns. This means
we can retrieve rows from x through y with df['x':'y']. The slice tells pandas to use the rows rather than the
columns. Moreover, the slice will return rows up to and including the endpoint, which is unusual for Python (but typical when using loc in pandas).

Another way to work with columns is to use dot notation. That is, if you want to retrieve the column colname from data
frame df, you can say ```df.colname```

In [78]:
print(df.a)
# But the notation is confusing because df.whatever is a column named whatever or an attribute named whatever.

x    10
y    50
z    90
Name: a, dtype: int64

### Filtering a Dataframe

#### Optimizing a data set for memory use

In [111]:
employees = pd.read_csv("employees.csv")
employees["Start Date"] = pd.to_datetime(employees["Start Date"], format='mixed')
employees.head()

  First Name  Gender Start Date    Salary   Mgmt       Team
0    Douglas    Male 1993-08-06       NaN   True  Marketing
1     Thomas    Male 1996-03-31   61933.0   True        NaN
2      Maria  Female        NaT  130590.0  False    Finance
3      Jerry     NaN 2005-03-04  138705.0   True    Finance
4      Larry    Male 1998-01-24  101004.0   True         IT

In [81]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

In [ ]:
##  Converting Data Types with the astype Method
print(employees['Mgmt'].head(10))

employees["Mgmt"] = employees["Mgmt"].astype(bool)

print(employees['Mgmt'].head(10))

In [92]:
## For Salary

#This will give an error
# employees['Salary']=employees['Salary'].astype(int)

employees["Salary"] = employees["Salary"].fillna(0).astype(int)

In [93]:
#For Gender
employees.nunique()

First Name    200
Gender          2
Start Date    971
Salary        995
Mgmt            2
Team           10
dtype: int64

In [95]:
employees["Gender"].astype("category")

0         Male
1         Male
2       Female
3          NaN
4         Male
         ...
996       Male
997       Male
998       Male
999       Male
1000       NaN
Name: Gender, Length: 1001, dtype: category
Categories (2, object): ['Female', 'Male']

In [96]:
employees["Gender"] = employees["Gender"].astype("category")
employees['Team']=employees['Team'].astype('category')

In [97]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    category
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      1001 non-null   int32
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    category
dtypes: bool(1), category(2), datetime64[ns](1), int32(1), object(1)
memory usage: 23.1+ KB

### Apply method

In [ ]:

print("1. Converting names to uppercase (fixed):")
print(employees['First Name'].fillna('').apply(str.upper))
print("\n")

#Or
print("1. Alternative approach:")
print(employees['First Name'].apply(lambda x: str(x).upper() if pd.notna(x) else np.nan))
print("\n")


def salary_category(salary):
    if pd.isna(salary):
        return "Unknown"
    elif salary < 80000:
        return "Entry"
    elif salary < 120000:
        return "Mid"
    else:
        return "Senior"

print("2. Categorizing salaries:")
print(employees['Salary'].apply(salary_category))

In [ ]:
## Filtering by a single condition 
employees[employees["First Name"] == "Maria"]
employees[employees["Team"] != "Finance"]
high_earners = employees["Salary"] > 100000
employees[high_earners].head()

In [ ]:
#Filtering by Multiple condition 
#isin method
all_star_teams = ["Sales", "Legal", "Marketing"]
on_all_star_teams = employees["Team"].isin(all_star_teams)
employees[on_all_star_teams].head()

In [ ]:
#between method
between_80k_and_90k = employees["Salary"].between(80000, 90000)
employees[between_80k_and_90k].head()

### Dealing with Null values

In [104]:
employees = pd.read_csv("employees.csv")
employees["Start Date"] = pd.to_datetime(employees["Start Date"], format='mixed')
# employees.head()
print(employees.shape)

(1001, 6)

In [105]:
employees=employees.dropna()
print(employees.shape)

(761, 6)

In [101]:
employees.dropna(how="all")
print(employees.shape)

(1001, 6)

In [106]:
employees=employees.dropna(how="any")
print(employees.shape)

(761, 6)

### Drop Duplicates

In [107]:
employees.drop_duplicates()

    First Name  Gender Start Date    Salary   Mgmt          Team
4        Larry    Male 1998-01-24  101004.0   True            IT
5       Dennis    Male 1987-04-18  115163.0  False         Legal
6         Ruby  Female 1987-08-17   65476.0   True       Product
8       Angela  Female 2005-11-22   95570.0   True   Engineering
9      Frances  Female 2002-08-08  139852.0   True  Business Dev
..         ...     ...        ...       ...    ...           ...
994     George    Male 2013-06-21   98874.0   True     Marketing
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[761 rows x 6 columns]

In [108]:
employees.drop_duplicates(subset = ["Team"])

   First Name  Gender Start Date    Salary   Mgmt          Team
4       Larry    Male 1998-01-24  101004.0   True            IT
5      Dennis    Male 1987-04-18  115163.0  False         Legal
6        Ruby  Female 1987-08-17   65476.0   True       Product
8      Angela  Female 2005-11-22   95570.0   True   Engineering
9     Frances  Female 2002-08-08  139852.0   True  Business Dev
12    Brandon    Male 1980-12-01  112807.0   True            HR
13       Gary    Male 2008-01-27  109831.0  False         Sales
14   Kimberly  Female 1999-01-14   41426.0   True       Finance
21    Matthew    Male 1995-09-05  100612.0  False     Marketing
40    Michael    Male 2008-10-10   99283.0   True  Distribution

### Groupby in Dataframe

In [116]:
print("1. Basic Aggregations by Team:")
print(employees.groupby('Team')['Salary'].agg(['mean', 'min', 'max', 'count']))
print("\n")

1. Basic Aggregations by Team:
                      mean      min       max  count
Team
Business Dev  91866.316832  36844.0  147417.0    101
Distribution  88500.466667  35575.0  149105.0     90
Engineering   94269.195652  36946.0  147362.0     92
Finance       92219.480392  35381.0  149908.0    102
HR            90944.527473  35203.0  149903.0     91
IT            88224.424528  35095.0  147183.0    106
Legal         89303.613636  35061.0  148985.0     88
Marketing     90364.742268  36643.0  149456.0     97
Product       88665.505263  35013.0  149684.0     95
Sales         92173.436170  35802.0  149654.0     94

In [ ]:
# Multiple columns aggregation
print("2. Multiple Column Analysis by Team:")
groupby_result = employees.groupby('Team').agg({
    'Salary': ['mean', 'count'],
    'Mgmt': 'sum',  # Count of managers (True values)
    'Gender': lambda x: x.value_counts().get('Female', 0)  # Count of females
})
print(groupby_result)
print("\n")

In [ ]:
# Size vs Count
print("3. Size vs Count (Size includes NaN):")
print("Size:")
print(employees.groupby('Team').size())
print("\nCount:")
print(employees.groupby('Team').count())
print("\n")

## Merging, Concatenating & Joins

In [121]:
groups1 = pd.read_csv("meetup/groups1.csv")
print(groups1.shape)
groups1.head()

(7999, 4)

   group_id                           name  category_id  city_id
0      6388         Alternative Health NYC           14    10001
1      6510      Alternative Energy Meetup            4    10001
2      8458              NYC Animal Rights           26    10001
3      8940  The New York City Anime Group           29    10001
4     10104             NYC Pit Bull Group           26    10001

In [122]:
groups2 = pd.read_csv("meetup/groups2.csv")
print(groups2.shape)
groups2.head()

(8331, 4)

,group_id,name,category_id,city_id
0,18879327,BachataMania,5,10001
1,18880221,Photoshoot Chicago - Photography and Modeling ...,27,60601
2,18880426,Chicago Adult Push / Kick Scooter Group Riding...,31,60601
3,18880495,Chicago International Soccer Club,32,60601
4,18880695,Impact.tech San Francisco Meetup,2,94101

In [123]:
pd.concat(objs = [groups1, groups2])

,group_id,name,category_id,city_id
0,6388,Alternative Health NYC,14,10001
1,6510,Alternative Energy Meetup,4,10001
2,8458,NYC Animal Rights,26,10001
3,8940,The New York City Anime Group,29,10001
4,10104,NYC Pit Bull Group,26,10001
...,...,...,...,...
8326,26377464,Shinect,34,94101
8327,26377698,The art of getting what you want [conference s...,14,94101
8328,26378067,Streeterville Running Group,9,60601
8329,26378128,Just Dance NYC,23,10001
8330,26378470,FREE Arabic Chicago Evanston North Burbs,31,60601

In [124]:
pd.concat(objs = [groups1, groups2], ignore_index = True)

,group_id,name,category_id,city_id
0,6388,Alternative Health NYC,14,10001
1,6510,Alternative Energy Meetup,4,10001
2,8458,NYC Animal Rights,26,10001
3,8940,The New York City Anime Group,29,10001
4,10104,NYC Pit Bull Group,26,10001
...,...,...,...,...
16325,26377464,Shinect,34,94101
16326,26377698,The art of getting what you want [conference s...,14,94101
16327,26378067,Streeterville Running Group,9,60601
16328,26378128,Just Dance NYC,23,10001
16329,26378470,FREE Arabic Chicago Evanston North Burbs,31,60601

In [125]:
pd.concat(objs = [groups1, groups2], keys = ["G1", "G2"])

         group_id                                               name  \
G1 0         6388                             Alternative Health NYC
   1         6510                          Alternative Energy Meetup
   2         8458                                  NYC Animal Rights
   3         8940                      The New York City Anime Group
   4        10104                                 NYC Pit Bull Group
...           ...                                                ...
G2 8326  26377464                                            Shinect
   8327  26377698  The art of getting what you want [conference s...
   8328  26378067                        Streeterville Running Group
   8329  26378128                                     Just Dance NYC
   8330  26378470           FREE Arabic Chicago Evanston North Burbs

         category_id  city_id
G1 0              14    10001
   1               4    10001
   2              26    10001
   3              29    10001
   4              26    10001
...              ...      ...
G2 8326           34    94101
   8327           14    94101
   8328            9    60601
   8329           23    10001
   8330           31    60601

[16330 rows x 4 columns]

In [126]:
groups = pd.concat(objs = [groups1, groups2], ignore_index = True)

### Merging

In [129]:
categories = pd.read_csv("meetup/categories.csv")
categories.head()

   category_id            category_name
0            1           Arts & Culture
1            3       Cars & Motorcycles
2            4  Community & Environment
3            5                  Dancing
4            6     Education & Learning

In [130]:
cities = pd.read_csv(
    "meetup/cities.csv", dtype = {"zip": "string"}
)
cities.head()

      id            city state    zip
0   7093   West New York    NJ  07093
1  10001        New York    NY  10001
2  13417  New York Mills    NY  13417
3  46312    East Chicago    IN  46312
4  56567  New York Mills    MN  56567

In [131]:
groups.head(3)

   group_id                       name  category_id  city_id
0      6388     Alternative Health NYC           14    10001
1      6510  Alternative Energy Meetup            4    10001
2      8458          NYC Animal Rights           26    10001

In [133]:
categories.head(3)

   category_id            category_name
0            1           Arts & Culture
1            3       Cars & Motorcycles
2            4  Community & Environment

In [134]:
#Left Join
groups.merge(categories, how = "left", on = "category_id").head()

,group_id,name,category_id,city_id,category_name
0,6388,Alternative Health NYC,14,10001,Health & Wellbeing
1,6510,Alternative Energy Meetup,4,10001,Community & Environment
2,8458,NYC Animal Rights,26,10001,NaN
3,8940,The New York City Anime Group,29,10001,Sci-Fi & Fantasy
4,10104,NYC Pit Bull Group,26,10001,NaN

In [ ]:
#Inner Join
groups.merge(categories, how = "inner", on = "category_id")

In [ ]:
#Outer Join
groups.merge(
    cities, how = "outer", left_on = "city_id", right_on = "id"
)